Repository: abdikaimovn/KirisShygysApp
Catalog: KirisShygysAppStore/Support/Localization/*.lproj/Localizable.strings
Languages: kk, kk_kz

# onboarding_firstPage_title
source: Gain total control of your money
kk: Ақшаңызды толық бақылауға алыңыз
kk_kz: Aqshańyzdy tolyq baqylaýǵa alyńyz

# onboarding_firstPage_description
source: Become your own money manager and make every cent count
kk: Өзіңіздің ақша менеджеріңіз болып, әрбір тиынды есептеңіз
kk_kz: Ózińizdiń aqsha menedjerińiz bolyp, árbir tıyndy esepteńiz

# onboarding_secondPage_title
source: Know where your money goes
kk: Ақшаңыздың қайда кететінін біліңіз
kk_kz: Aqshańyzdyń qaıda ketetinin bilińiz

# onboarding_secondPage_description
source: Track your transaction easily, with a financial report
kk: Қаржылық есеппен аударымдарыңызды оңай қадағалаңыз
kk_kz: Qarjylyq eseppen aýdarymdaryńyzdy ońaı qadaǵalańyz

# name_textField_placeholder
source: Name
kk: Аты
kk_kz: Aty

# email_textField_placeholder
source: Email
kk: Электрондық пошта
kk_kz: Elektrondyq poshta

# password_textField_placeholder
source: Password
kk: Құпия сөз
kk_kz: Qupıa sóz

# signIn_button_title
source: Sign In
kk: Кіру
kk_kz: Kirý

# absentAccount_title
source: Don't have an account?
kk: Аккаунтыңыз жоқ па?
kk_kz: Akkaýntyńyz joq pa?

# signUp_button_title
source: Sign Up
kk: Тіркелу
kk_kz: Tirkelý

# apply_button_title
source: Apply
kk: Іске асыру
kk_kz: Iske asyrý

# save_button_title
source: Save
kk: Сақтау
kk_kz: Saqtaý

# reset_button_title
source: Reset
kk: Жою
kk_kz: Joıý

# retry_button_title
source: Retry
kk: Қайталау
kk_kz: Qaıtalaý

# restart_button_title
source: Restart
kk_kz: Qaıta iske qosý

# resetPassword_title
source: Reset Password
kk_kz: Qupıa sózdi qalpyna keltirý

# forgetPassword_label
source: Forgot password?
kk_kz: Qupıa sózdi umyttyńyz ba?

# invalidEmail_error
source: • Email must be valid according to email address standards.
kk: • Электрондық пошта электрондық пошта стандарттарына сәйкес жарамды болуы керек.
kk_kz: • Elektrondyq poshta elektrondyq poshta standarttaryna sáıkes jaramdy bolýy kerek.

# invalidUsername_error
source: • Username must consist of 2 to 24 characters and can contain letters, digits
kk: • Пайдаланушы аты 2-ден 24 таңбаға дейін болуы керек және әріптер, сандар қабылдай алады
kk_kz: • Paıdalanýshy aty 2-den 24 tańbaǵa deıin bolýy kerek jáne áripter, sandar qabyldaı alady

# invalidPassword_error
source: • Password must be more than 6 characters
kk: • Құпия сөздің ұзындығы 6-дан 32 таңбаға дейін болуы керек және келесі жиыннан кемінде бір кіші әріп, бір бас әріп, бір сан және бір арнайы таңбадан тұруы керек:$,@,#,!, _, ., %, *, ?, &.
kk_kz: • Qupıa sózdiń uzyndyǵy 6-dan 32 tańbaǵa deıin bolýy kerek jáne kelesi jıynnan keminde bir kishi árip, bir bas árip, bir san jáne bir arnaıy tańbadan turýy kerek:$,@,#,!, _, ., %, *, ?, &.

# authorization_error_title
source: Authorization Error
kk: Авторизация катесі
kk_kz: Avtorızasıa katesi

# registration_error_title
source: Registration Error
kk: Тіркеу қатесі
kk_kz: Tirkeý qatesi

# credentialAlreadyInUse_error
source: The credentials are already in use
kk: Тіркелгі деректері қазірдің өзінде қолданыста
kk_kz: Tirkelgi derekteri qazirdiń ózinde qoldanysta

# invalidCredential_error
source: The supplied auth credential is malformed or has expired.
kk: Берілген тіркелгі деректерінің пішіні бұзылған немесе мерзімі өтіп кеткен.
kk_kz: Berilgen tirkelgi derekteriniń pishini buzylǵan nemese merzimi ótip ketken.

# network_error_title
source: Network Error
kk: Желі қатесі
kk_kz: Jeli qatesi

# userNotFound_error
source: User wasn't found
kk: Пайдаланушы табылмады
kk_kz: Paıdalanýshy tabylmady

# network_error
source: The network connection was interrupted
kk: Желі қосылымы үзілді
kk_kz: Jeli qosylymy úzildi

# unknown_error_title
source: Unknown Error
kk: Белгісіз қате
kk_kz: Belgisiz qate

# unknown_error
source: Something went wrong
kk: Белгісіз қате табылды
kk_kz: Belgisiz qate tabyldy

# noTransaction
source: You have not made any transactions in the current month
kk: Сіз ағымдағы айда ешқандай аударым жасаған жоқсыз
kk_kz: Siz aǵymdaǵy aıda eshqandaı aýdarym jasaǵan joqsyz

# error_title
source: Error
kk: Қате
kk_kz: Qate

# usernameFetching_error
source: Error with extracting the user name
kk: Пайдаланушы атын шығарудағы қате
kk_kz: Paıdalanýshy atyn shyǵarýdaǵy qate

# documentFetching_error
source: Error with extracting the user's transactions
kk: Пайдаланушының аударымдарын шығарудағы қате
kk_kz: Paıdalanýshynyń aýdarymdaryn shyǵarýdaǵy qate

# transactionDeleting_error
source: Error with deleting the transaction
kk: Аударымды жою қатесі
kk_kz: Aýdarymdy joıý qatesi

# logOut_error
source: Error with logging out
kk: Жүйеден шығу қатесі
kk_kz: Júıeden shyǵý qatesi

# emailNotFound_error
source: The specified email was not found
kk_kz: Kórsetilgen elektrondyq poshta tabylmady

# welcome_label
source: Welcome back
kk: Қош келдіңіз
kk_kz: Qosh keldińiz

# totalBalance_label
source: Total balance
kk: Жалпы баланс
kk_kz: Jalpy balans

# incomes_label
source: Incomes
kk: Кірістер
kk_kz: Kirister

# expenses_label
source: Expenses
kk: Шығыстар
kk_kz: Shyǵystar

# total_label
source: Total
kk: Барлығы
kk_kz: Barlyǵy

# transactions_label
source: Transactions
kk: Аударымдар
kk_kz: Aýdarymdar

# history_label
source: History
kk: Тарих
kk_kz: Tarıh

# today_label
source: Today
kk: Бүгін
kk_kz: Búgin

# yesterday_label
source: Yesterday
kk: Кеше
kk_kz: Keshe

# filterTransactions_label
source: Filter transactions
kk: Сүзгі
kk_kz: Súzgi

# absenceData_label
source: No transactions were found
kk: Ешқандай аударым табылған жоқ
kk_kz: Eshqandaı aýdarym tabylǵan joq

# filterBy_label
source: Filter By
kk: Сүзгілеу
kk_kz: Súzgileý

# sortBy_label
source: Sort By
kk: Сұрыпта
kk_kz: Suryptaý

# period_label
source: Period
kk: Кезең
kk_kz: Kezeń

# newest_button_title
source: Newest
kk: Ең жаңасы
kk_kz: Eń jańasy

# oldest_button_title
source: Oldest
kk: Ең ескісі
kk_kz: Eń eskisi

# week_button_title
source: Week
kk: Апта
kk_kz: Apta

# month_button_title
source: Month
kk: Ай
kk_kz: Aı

# halfYear_button_title
source: 6 months
kk: Жарты жыл
kk_kz: Jarty jyl

# year_button_title
source: Year
kk: Жыл
kk_kz: Jyl

# amount_label
source: How much ?
kk: Ақша көлемі
kk_kz: Aqsha kólemi

# name_label
source: Name
kk: Аты
kk_kz: Aty

# description_label
source: Description
kk: Сипаттама
kk_kz: Sıpattama

# date_label
source: Date
kk: Күні
kk_kz: Kúni

# emptyTransactionFieldError_title
source: Error
kk: Қате
kk_kz: Qate

# emptyTransactionField_error
source: You need to specify required fields such as: name, amount
kk: Cізге қажетті өрістерді көрсету керек, мысалы: аты, ақша көлемі
kk_kz: Sizge qajetti óristerdi kórsetý kerek, mysaly: aty, aqsha kólemi

# transactionType_label
source: Type:
kk: Аударым түрі:
kk_kz: Aýdarym túri:

# transactionName_label
source: Name:
kk: Аты:
kk_kz: Aty:

# transactionAmount_label
source: Amount:
kk: Ақша көлемі:
kk_kz: Aqsha kólemi:

# transactionDate_label
source: Date:
kk: Күні:
kk_kz: Kúni:

# transactionDescription_label
source: Description:
kk: Сипаттама:
kk_kz: Sıpattama:

# emptyDescription
source: Transaction description not specified
kk: Аударым сипаттамасы көрсетілмеген
kk_kz: Aýdarym sıpattamasy kórsetilmegen

# menu_label
source: Menu
kk: Мәзір
kk_kz: Mazır

# transactionReport_label
source: Transaction Report
kk: Аударымдар есебі
kk_kz: Aýdarymdar esebi

# settings_label
source: Settings
kk: Параметрлер
kk_kz: Parametrler

# statistics_label
source: Statistics
kk: Статистика
kk_kz: Statıstıka

# logout_label
source: Logout
kk: Шығу
kk_kz: Shyǵý

# transactionReportTitle_label
source: Report
kk: Аударымдар есебі
kk_kz: Aýdarymdar esebi

# thisMonthTitle_label
source: This Month
kk: Ағымдағы ай
kk_kz: Aǵymdaǵy aı

# spend_label
source: You Spent 💸
kk: Сіздің шығыстарыңыз 💸
kk_kz: Sizdiń shyǵystaryńyz 💸

# earn_label
source: You Earned 💰
kk: Сіздің кірістеріңіз 💰
kk_kz: Sizdiń kiristerińiz 💰

# biggestSpending_label
source: And your biggest spending is from
kk: Және сіздің ең үлкен шығысыңыз
kk_kz: Jáne sizdiń eń úlken shyǵysyńyz

# biggentEarning_label
source: Your biggest earning is from
kk: Сіздің ең үлкен кірісіңіз
kk_kz: Sizdiń eń úlken kirisińiz

# quoteTitle_label
source: Quote of the month
kk: Айдың дәйексөзі
kk_kz: Aıdyń dáıeksózi

# language_label
source: Language
kk: Тіл
kk_kz: Til

# currency_label
source: Currency
kk: Валюта
kk_kz: Valúta

# personalInfo_label
source: Personal information
kk: Жеке ақпарат
kk_kz: Jeke aqparat

# trash_label
source: Clear the history
kk_kz: Tarıhty joıý

# statisticsTitle_label
source: Statistics for last month
kk: Ағымдағы айдың статистикасы
kk_kz: Aǵymdaǵy aıdyń statısıkasy

# lackDataAlert_title
source: Lack of Data
kk: Деректер жеткіліксіз
kk_kz: Derekter jetkiliksiz

# historyLackDataAlert_message
source: Lack of data to display your history. Add any transaction for access
kk: Тарихыңызды көрсету үшін деректер жоқ. Көру үшін кез келген аударым қосыңыз
kk_kz: Tarıhyńyzdy kórsetý úshin derekter joq. Kórý úshin kez kelgen aýdarym qosyńyz

# reportLackDataAlert_message
source: Lack of data to display your report. Add any transaction for access
kk: Есепті көрсету үшін деректер жоқ. Көру үшін кез келген аударым қосыңыз
kk_kz: Esepti kórsetý úshin derekter joq. Kórý úshin kez kelgen aýdarym qosyńyz

# statisticsLackDataAlert_message
source: Lack of data to display your statistics. Add any transaction for access
kk: Статистикаңызды көрсету үшін деректер жоқ. Көру үшін кез келген аударым қосыңыз
kk_kz: Statısıkańyzdy kórsetý úshin derekter joq. Kórý úshin kez kelgen aýdarym qosyńyz

# emailVerificationAlert
source: A link has been sent to the email address you specified to activate your account! (Check the spam folder)
kk_kz: Akkaýntty iske qosý úshin elektrondyq poshtańyzǵa silteme jiberildi! (Spam qaltasyn tekserińiz)

# verificationError_title
source: Verification Error
kk_kz: Verıfıkasıa qatesi

# notVerifiedEmail_error
source: Provided email is not verified
kk_kz: Kórsetilgen elektrondyq poshta rastalmaǵan

# aiyaz_uddin_quote
source: Money is not understood by many, even though many earn it and only a few master it.
kk: Ақшаны көп адамдар түсінбейді, бірақ көбісі оны табады, және кейбіреулері ғана игереді
kk_kz: Aqshany kóp adamdar túsinbeıdi, biraq kóbisi ony tabady, jáne keıbireýleri ǵana ıgeredi

# linsey_mill_quote
source: Like a well-nourished body, a healthy cash flow is essential for the vitality of your financial future.
kk: Жақсы күтілген ағза сияқты, күтілген ақша ағыны сіздің қаржылық болашағыңыз үшін өте маңызды.
kk_kz: Jaqsy kútilgen aǵza sıaqty, kútilgen aqsha aǵyny sizdiń qarjylyq bolashaǵyńyz úshin óte mańyzdy.

# oscar_wilde_quote
source: When I was young I thought that money was the most important thing in life; now that I am old I know that it is
kk: Жас кезімде ақша өмірдегі ең маңызды нәрсе деп ойладым. Енді өскенімде оның солай екеніне көзім жетті
kk_kz: Jas kezimde aqsha ómirdegi eń mańyzdy nárse dep oıladym. Endi óskenimde onyń solaı ekenine kózim jetti

# robert_kiyosaki_quote1
source: The more we knew about the power of money, the more distant we grew from the teachers and our classmates
kk: Ақшаның құдыреті туралы көбірек білген сайын, мұғалімдер мен сыныптастарымыздан алыстап кеттік
kk_kz: Aqshanyń qudyreti týraly kóbirek bilgen saıyn, muǵalimder men synyptastarymyzdan alystap kettik

# suze_orman_quote
source: People have got to learn: if they don’t have cookies in the cookie jar, they can’t eat cookies.
kk: Адамдар түсінуі керек: егер кәмпит құмырасында кәмпит болмаса, олар кәмпит жей алмайды
kk_kz: Adamdar túsinýi kerek: eger kámpıt qumyrasynda kámpıt bolmasa, olar kámpıt jeı almaıdy

# robert_kiyosaki_quote2
source: If you want to be rich and maintain your wealth, it’s important to be financially literate, in words as well as numbers
kk: Угер сіз бай болғыңыз келсе және байлығыңызды сақтап қалғыңыз келсе, сөзбен де, санмен де қаржылық сауатты болу маңызды
kk_kz: Eger siz baı bolǵyńyz kelse jáne baılyǵyńyzdy saqtap qalǵyńyz kelse, sózben de, sanmen de qarjylyq saýatty bolý mańyzdy

# alan_greenspan_quote
source: The number one problem in today’s generation and economy is the lack of financial literacy
kk: Бүгінгі ұрпақ пен экономикадағы бірінші мәселе - қаржылық сауаттылықтың жоқтығы
kk_kz: Búgingi urpaq pen ekonomıkadaǵy birinshi másele - qarjylyq saýattylyqtyń joqtyǵy

# robert_kiyosaki_quote3
source: Intelligence solves problems and produces money. Money without financial intelligence is money soon gone
kk: Қаржылық сауаттылық мәселелерді шешеді және ақша табуға көмектеседі. Қаржылық сауаттылықсыз келген ақша - бұл көп ұзамай жоғалып кеткен ақша
kk_kz: Qarjylyq saýattylyq máselelerdi sheshedi jáne aqsha tabýǵa kómektesedi. Qarjylyq saýattylyqsyz kelgen aqsha - bul kóp uzamaı joǵalyp ketken aqsha

# benjamin_franklin_quote
source: Wise men learn by others harms, fools scarcely by their own.
kk: Данышпандар басқалардың зиянынаң, ақымақтар өздерінің зиянынаң үйренеді
kk_kz: Danyshpandar basqalardyń zıanynań, aqymaqtar ózderiniń zıanynań úırenedi

# orrin_woodward_quote
source: A person either disciplines his finances or his finances discipline him
kk: Адам өз қаржысын тәртіпке келтіреді немесе қаржысы оны тәртіпке келтіреді
kk_kz: Adam óz qarjysyn tártipke keltiredi nemese qarjysy ony tártipke keltiredi

# asanali_ashimov_quote
source: To spend your whole life chasing money is to be equal to death.
kk: Бүкіл өміріңді ақша табуға арнау – өліммен тең
kk_kz: Búkil ómirińdi aqsha tabýǵa arnaý – ólimmen teń

# margulan_seisembai_quote
source: The primary function of a woman in the family is to manage resources, not to earn money.
kk: Әйелдің отбасындағы негізгі функциясы - тәуекелдерді басқару. Ақша табу емес, ақша үнемдеу.
kk_kz: Áıeldiń otbasyndaǵy negizgi fýnksıasy - táýekelderdi basqarý. Aqsha tabý emes, aqsha únemdeý.

# qazaq_quote1
source: If you call yourself a human, don't sell your dignity for money
kk: Адам болам десең, арыңды ақшаға сатпа
kk_kz: Adam bolam deseń, aryńdy aqshaǵa satpa

# qazaq_quote2
source: The humor of a rich man is always funny.
kk: Бай адамның әзілі әрдайым күлкілі.
kk_kz: Baı adamnyń ázili árdaıym kúlkili.

# qazaq_quote3
source: The goal of the Fool is wealth, the goal of the Smart is morality.
kk: Ақымақтың мақсаты – байлық, ақылдының мақсаты – адамгершілік.
kk_kz: Aqymaqtyń maqsaty – baılyq, aqyldynyń maqsaty – adamgershilik.

# qazaq_quote4
source: Satisfaction is the greatest wealth
kk: Қанағат ету – ең үлкен байлық
kk_kz: Qanaǵat etý – eń úlken baılyq

# warning_title
source: Warning
kk_kz: Eskertý

# languageWarning_label
source: Do you really want to change the language of the application?
kk_kz: Siz rasynda da qoldanba tilin ózgertkińiz kele me?

# yes_label
source: Yes
kk_kz: Iá

# no_label
source: No
kk_kz: Joq

# clearHistory_message
source: Are you sure you want to clear the history? The data cannot be returned
kk_kz: Siz tarıhty tazartqyńyz keletinine senimdisiz be? Derekterdi qaıtarý múmkin emes

# oldPassword_placeholder
source: Old password
kk_kz: Eski qupıa sóz

# newPassword_placeholder
source: New password
kk_kz: Jańa qupıa sóz

# passwordChange_title
source: Change the password
kk_kz: Qupıa sózdi ózgertý

# resetPassword_message
source: A link to reset your password has been sent to the email address you provided (Check the spam folder)
kk_kz: Siz kórsetken elektrondyq poshta mekenjaıyna qupıa sózdi qalpyna keltirý siltemesi jiberildi (spam qaltasyn tekserińiz)

# alert_dismissButton_title
source: Ok
kk: Ок
